---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleData.UpdateLoadSummary
source: html/124f82f2-b09c-7941-bb9d-96cc8f285eef.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.UpdateLoadSummary Method

Update the load summary section

## Syntax (C#)
```csharp
public void UpdateLoadSummary()
```